## Prepare a Dataset

In [1]:
import pandas as pd
import numpy as np

In [2]:
df= pd.read_csv("09_Prepare_Dataset/Diabetes.csv")
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 768 entries, 0 to 767
Data columns (total 9 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Pregnancies               768 non-null    int64
 1   Glucose                   768 non-null    int64
 2   BloodPressure             768 non-null    int64
 3   SkinThickness             768 non-null    int64
 4   Insulin                   768 non-null    int64
 5   BMI                       768 non-null    float64
 6   DiabetesPedigreeFunction  768 non-null    float64
 7   Age                       768 non-null    int64
 8   Outcome                   768 non-null    int64
dtypes: float64(2), int64(7)
memory usage: 54.1 KB

In [6]:
df.head()

,Pregnancies,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome
0,6,148,72,35,0,33.6,0.627,50,1
1,1,85,66,29,0,26.6,0.351,31,0
2,8,183,64,0,0,23.3,0.672,32,1
3,1,89,66,23,94,28.1,0.167,21,0
4,0,137,40,35,168,43.1,2.288,33,1

In [7]:
df=df.fillna(0)   ## Assigning "0" to all None values

In [8]:
df2=df[["Glucose","BMI","Age","Outcome"]]
df2.head()

   Glucose   BMI  Age  Outcome
0      148  33.6   50        1
1       85  26.6   31        0
2      183  23.3   32        1
3       89  28.1   21        0
4      137  43.1   33        1

In [9]:
df2.describe()

          Glucose         BMI         Age     Outcome
count  768.000000  768.000000  768.000000  768.000000
mean   120.894531   31.992578   33.240885    0.348958
std     31.972618    7.884160   11.760232    0.476951
min      0.000000    0.000000   21.000000    0.000000
25%     99.000000   27.300000   24.000000    0.000000
50%    117.000000   32.000000   29.000000    0.000000
75%    140.250000   36.600000   41.000000    1.000000
max    199.000000   67.100000   81.000000    1.000000

In [7]:
df2.columns

Index(['Glucose', 'BMI', 'Age', 'Outcome'], dtype='object')

In [13]:
# df2.columns[::-1]  #Reverse
df2.columns[:-1]    #Include every column but dont include the last one (i.e outcome)

Index(['Glucose', 'BMI', 'Age'], dtype='object')

In [28]:
# df2[df2.columns[:-1]]==0                  #Getting a Bollean Mask


# (df2[df2.columns[:-1]]==0).any(axis=1)     #created boolean mask SINGLE LIST to remove data point where there is 0 in 
                                             #any column


#use the above boolean list to extract the data we want  
df3=df2.loc[(df2[df2.columns[:-1]]==0).any(axis=1)]   #All data with value 0 i.e True with zero. But we want True value


#So, use tilda(~)
df3=df2.loc[ ~ (df2[df2.columns[:-1]]==0).any(axis=1)]
df3

     Glucose   BMI  Age  Outcome
0        148  33.6   50        1
1         85  26.6   31        0
2        183  23.3   32        1
3         89  28.1   21        0
4        137  43.1   33        1
..       ...   ...  ...      ...
763      101  32.9   63        0
764      122  36.8   27        0
765      121  26.2   30        0
766      126  30.1   47        1
767       93  30.4   23        0

[752 rows x 4 columns]

In [30]:
df3.describe()                   #Now Glucose & BMI donot have values 0

          Glucose         BMI         Age     Outcome
count  752.000000  752.000000  752.000000  752.000000
mean   121.941489   32.454654   33.312500    0.351064
std     30.601198    6.928926   11.709395    0.477621
min     44.000000   18.200000   21.000000    0.000000
25%     99.750000   27.500000   24.000000    0.000000
50%    117.000000   32.300000   29.000000    0.000000
75%    141.000000   36.600000   41.000000    1.000000
max    199.000000   67.100000   81.000000    1.000000

In [32]:
df3.info()    #now we have total 752 row
              #Earlier we have 758 row ..... So we lost 6 row

<class 'pandas.core.frame.DataFrame'>
Int64Index: 752 entries, 0 to 767
Data columns (total 4 columns):
Glucose    752 non-null int64
BMI        752 non-null float64
Age        752 non-null int64
Outcome    752 non-null int64
dtypes: float64(1), int64(3)
memory usage: 29.4 KB

In [35]:
#Now we will work on OUTCOME columns
df3.groupby("Outcome")      #return a groupby object

In [38]:
df3.groupby("Outcome").mean()
#In General, with the data we can say, those who have Diabetes are older in age, have high BMI & GLocose

            Glucose        BMI        Age
Outcome
0        110.825820  30.876434  31.309426
1        142.488636  35.371970  37.015152

In [41]:
#Now we will pass a Dictionary to a agg() function -- to link columns name with the aggregate method we want to use 
df3.groupby("Outcome").agg({"Glucose":"mean"})

            Glucose
Outcome
0        110.825820
1        142.488636

In [43]:
df3.groupby("Outcome").agg({"Glucose":"mean","BMI":"median","Age":"sum"})  #Just for practice (- Median & sum are used)

            Glucose    BMI    Age
Outcome
0        110.825820  30.10  15279
1        142.488636  34.25   9772

In [45]:
#Getting Multiple aggreagte function

df3.groupby("Outcome").agg(["mean","median"])  #passing a list to agg() function to get multiple agg() functions

            Glucose               BMI               Age
               mean median       mean median       mean median
Outcome
0        110.825820  107.5  30.876434  30.10  31.309426     27
1        142.488636  140.5  35.371970  34.25  37.015152     36

In [53]:
# Spliting data for Outcome=0 & Outcome =1

df3["Outcome"]==1

positive = df3.loc[df3["Outcome"]==1]    #using df.loc to apply mask
negative = df3.loc[df3["Outcome"]==0]

print(positive.shape, negative.shape)

(264, 4) (488, 4)

In [55]:
# df3.to_csv("clean_diabetes.csv")    #Note : Pandas saves data with index
df3.to_csv("clean_diabetes.csv", index=False)   #Data saved without INDEX